<a href="https://colab.research.google.com/github/Roman-Romanow/skillbox-chat/blob/master/hw1_RomanovRV.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

<h1>Задание:</h1>
<h2> 1) необходимо считать данные (id, age, gender, occupation, salary )</h2>
<a href="https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/u.user">Ссылка на DataFrame (GitHub)</a>

In [64]:
user_cols = ['id', 'age', 'gender', 'occupation', 'salary']
users = pd.read_table('https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/u.user', sep='|', header=None, names=user_cols)
users.head()

   id  age gender  occupation salary
0   1   24      M  technician  85711
1   2   53      F       other  94043
2   3   23      M      writer  32067
3   4   24      M  technician  43537
4   5   33      F       other  15213

In [65]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
id            943 non-null int64
age           943 non-null int64
gender        943 non-null object
occupation    943 non-null object
salary        943 non-null object
dtypes: int64(2), object(3)
memory usage: 37.0+ KB

<h2> 2) найдите кол-во мужчин и женщин.</h2>

In [66]:
users[(users.gender == 'M')].shape

(670, 5)

In [67]:
users[(users.gender == 'F')].shape

(273, 5)

<h2>3) найдите средний возраст</h2>

In [68]:
users.describe(include='number')

               id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

<h2>4) найдите записи о женщинах, у которых зп выше средней зп мужчин</h2>

In [83]:
users.dtypes

id             int64
age            int64
gender        object
occupation    object
salary        object
dtype: object

In [0]:
index = users[users.salary.str.isdigit() == False].index
users.drop(index, inplace=True)

In [107]:
users.salary = users.salary.astype('int')
users.info

<bound method DataFrame.info of       id  age gender     occupation  salary
0      1   24      M     technician   85711
1      2   53      F          other   94043
2      3   23      M         writer   32067
3      4   24      M     technician   43537
4      5   33      F          other   15213
..   ...  ...    ...            ...     ...
938  939   26      F        student   33319
939  940   32      M  administrator    2215
940  941   20      M        student   97229
941  942   48      F      librarian   78209
942  943   22      M        student   77841

[925 rows x 5 columns]>

In [114]:
users.dtypes

id             int64
age            int64
gender        object
occupation    object
salary         int64
dtype: object

In [112]:
users.groupby('gender').salary.agg(['count', 'mean', 'min', 'max', 'std', 'median'])

        count          mean  min    max           std  median
gender
F         269  50620.888476    0  99709  29813.478660   53202
M         656  50970.442073    0  99835  31344.393885   55017

In [120]:
females = users[(users.salary > 50970.442073) & (users.gender == 'F')]
females

      id  age gender  occupation  salary
1      2   53      F       other   94043
14    15   49      F    educator   97301
19    20   42      F   homemaker   95660
23    24   21      F      artist   94533
31    32   28      F     student   78741
..   ...  ...    ...         ...     ...
910  911   37      F      writer   53210
919  920   30      F      artist   90008
920  921   20      F     student   98801
937  938   38      F  technician   55038
941  942   48      F   librarian   78209

[141 rows x 5 columns]

<h2>4.1) найдите их средний возраст</h2>

In [123]:
females.describe(include='number')

               id         age        salary
count  141.000000  141.000000    141.000000
mean   501.404255   34.269504  74762.241135
std    272.872759   12.065819  16638.023140
min      2.000000   13.000000  51250.000000
25%    270.000000   24.000000  55414.000000
50%    531.000000   33.000000  77009.000000
75%    733.000000   44.000000  92093.000000
max    942.000000   62.000000  99709.000000

In [124]:
females.age.mean()

34.269503546099294